<a href="https://colab.research.google.com/github/archisha13/GDSC_task/blob/main/Solution2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# QUESTION 2

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("/content/titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
df['Age'].dtype

dtype('float64')

In [8]:
numerics = ['int16', 'int32', 'int64','float64']
df = df.select_dtypes(include=numerics)

In [9]:
df.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

All the below columns are numeric columns

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          714 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Fare         891 non-null    float64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

2. Remove the null values from column ‘Age’, ‘Fare’.

In [12]:
df['Age'].isna().sum()

177

177 null values in age column

In [13]:
new_col = df['Age'].dropna()
new_col.isna().sum()

0

In [14]:
df['Age'].dtype

dtype('float64')

In [15]:
#No zeroes present in Age column
column = df['Age']
count_of_zeroes = column[column == 0].count()
print(count_of_zeroes)

0

Now checking for Fare

In [16]:
column = df['Fare']
count_of_zeroes = column[column == 0].count()
print(count_of_zeroes)

15

In [17]:
df['Fare'].isna().sum()

0

No null values are present but there are zeroes

In [18]:
df['Fare'].dtype

dtype('float64')

In [19]:
df['Fare'].isin([0]).any().any()

True

 3 . Replace the null values of ‘Age’ and ‘Fare’ with the column mean.

In [20]:
df['Age'].fillna(value=df['Age'].mean(), inplace=True)

In [21]:
df['Age'].isna().sum()

0

Now for Fare column

In [32]:
#There are no null values in Fare column but there are 0 values 
#Replacing 0 with mean since a ticket fare cannot be 0
df['Fare'].replace(to_replace=0.0,value=df['Fare'].mean(),inplace=True)

In [33]:
df['Fare'].isin([0]).any().any()

False

In [34]:
column = df['Fare']
count_of_zeroes = column[column == 0].count()
print(count_of_zeroes)

0

In [35]:
#Another method for checking if 0 is present or not
df['Age'].isin([0]).any().any()
# if there is a 0 in any row of column age it will return true

False